{
    "works2023": [
        {
            "id": 1,
            "titleHeading": "FireWatcher",
            "titleSubheading":  "NASA Space Apps",
            "previewImg": "../../assets/img/works/2023/FireWatcher/preview-img.png",
            "logo": "../../assets/img/works/2023/FireWatcher/logoFireWatcher.png",
            "client": "NASA Space Apps Challenge",
            "type": "Hackathon",
            "year": 2023,
            "role": "UI Designer | FrontEnd Developer | Team Lead",
            "projectDescription": "FireWatcher is a groundbreaking application adressing the escalating threat of wildfires. This vital tool connects citizens with authorities, enabling swift responses and coordinated efforts for firefighting and evacuations. Incorporating NASA data and open science sources, FireWatcher provides real-time updates and predictions on fire evolution, trajectory, and virulence.",
            "projectRoleDescription": "As the UI Designer, FrontEnd Developer and Team Lead for FireWatcher, a project developed during a 36-hour NASA hackathon, I played a pivotal role in conceiving and executing an innovative solution for wildlife monitoring. Crafting a visually stunning and user-centric interface with Angular, HTML, and CSS, I transformed ideas into a tangible, engaging experience. I did not only shaped the application's frontend but also led the team composed by 6 programmers through the adrenaline-fueled hackathon. Your leadership, marked by enthusiasm and decisiveness, steered the collective efforts, turning challenges into opportunities.",
            "images": [
                "../../assets/img/works/2023/FireWatcher/image-two.png",
                "../../assets/img/works/2023/FireWatcher/image-one.png",
                "../../assets/img/works/2023/FireWatcher/image-three.png"
            ],
            "link": "https://www.spaceappschallenge.org/2023/find-a-team/virtual-black-hole/?tab=details"
        },
        {
            "id": 2,
            "titleHeading": "42",
            "titleSubheading":  "Tech2Peer",
            "previewImg": "../../assets/img/works/2023/42Tech2Peer/preview-img.png",
            "logo": "../../assets/img/works/2023/42Tech2Peer/logo42.png",
            "client": "42 Málaga Fundación Telefónica",
            "type": "",
            "year": 2023,
            "role": "UI Designer | FrontEnd Developer",
            "projectDescription": "42's Cybersecurity Capture The Flag (CTF) is a thrilling, beginner-friendly challenge designed to immerse participants into the world of cybersecurity. Tailored for those new to the field, this CTF offers a hands-on experience, encouraging problem-solving and critical thinking in a fun and supportive environment.",
            "projectRoleDescription": "As the UI designer and frontend developer for 42's CTF, I crafted the user interface in Figma and brought it to life using Angular. My role focused on delivering a visually appealing and user-friendly experience for participants navigating the cybersecurity challenges.",
            "images": [
                "../../assets/img/works/2023/42Tech2Peer/image-one.png",
                "../../assets/img/works/2023/42Tech2Peer/main-img.png",
                "../../assets/img/works/2023/42Tech2Peer/image-three.png"
            ]
        },
        {
            "id": 3,
            "titleHeading": "OpenTechies",
            "titleSubheading":  "JunctionXMalaga",
            "previewImg": "../../assets/img/works/2023/OpenTechies/preview-img.png",
            "logo": "../../assets/img/works/2023/OpenTechies/logoOpenTechies.png",
            "client": "JunctionXMalaga",
            "type": "Hackathon",
            "year": 2023,
            "role": "UI Designer | FrontEnd Developer | Team Lead",
            "projectDescription": "'Closely' secured a spot in the finals at the Junction Hackathon, is focused in elevating market appeal demands innovative tech solutions. We microsegment customers using real-time emotional and contextual data analyzed with AI. We collect info through facial recognition, location tracking, user history, companion profiles, external factors, and outfit style. Processed with a pre-trained AI model, this data personalizes offers through dynamic storefronts and the mall's app. The outcome: Improved shopping experiences, boosted advertising effectiveness, and increased customer satisfaction in malls.",
            "projectRoleDescription": "As the UI Designer, Frontend Developer, and Team Lead for 'Closely' in the 32-hour Junction Hackathon, I crafted a mobile web app mockup using Angular. From Figma design to functional app, my role involved ensuring seamless, user-friendly experiences. Us, a team composed by 5 programmers and designers with our collaborative effort secured 'Closely' a spot in the finals, showcasing our dedication to enhancing the mall experience for users.",
            "images": [
                "../../assets/img/works/2023/OpenTechies/image-one.png",
                "../../assets/img/works/2023/OpenTechies/main-img.png",
                "../../assets/img/works/2023/OpenTechies/image-two.png"
            ],
            "link": "https://github.com/SolAndrade/CloselyOpenTechies"
        },
        {
            "id": 4,
            "titleHeading": "Absences system",
            "titleSubheading":  "Hickathon",
            "previewImg": "../../assets/img/works/2023/Hickathon/main-img.png",
            "logo": "../../assets/img/works/2023/Hickathon/logo.png",
            "client": "Hicron",
            "type": "Hackathon",
            "year": 2023,
            "role": "Full Stack Developer",
            "projectDescription": "This Hackathon challenge was to implement an absences management web system in 40 hours. As a solution I Developed a robust system for employees and managers. Utilized HTML, CSS, JavaScript, GIT, NodeJS, Express, AngularJS, and MySQL Workbench. The outcome: Streamlined absence management, showcasing proficiency in diverse technologies and earning a finalist position in the Hicron Hackathon.",
            "projectRoleDescription": "I developed an Absences Management Web System. My role included implementing the system using HTML, CSS, JavaScript, GIT, NodeJS, Express, AngularJS, and MySQL Workbench. Our collaborative effort resulted in a finalist position, demonstrating the effective use of diverse technologies to streamline absence management within the given time frame.",
            "images": [
                "../../assets/img/works/2023/Hickathon/image-one.png",
                "../../assets/img/works/2023/Hickathon/image-two.png"
            ],
            "link": "https://github.com/SolAndrade/Hickathon"
        }
    ],
    "works2022": [
        
    ]
}